Tekla Open API Reference for Tekla Structures 2025
Picker.PickPoint Method
 Queries the user to pick a point from the model.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point PickPoint()
Public Function PickPoint As Point
Return Value
Type: Point
The point the user picked.
See Also
Reference
Picker Class
PickPoint Overload
Tekla.Structures.Model.UI Namespace